# **SQL JOINS**

A SQL JOIN [[Wikipedia]](https://en.wikipedia.org/wiki/Join_(SQL) statement is used to combine data or rows from two or more tables based on a common or related field between them.

## **Different types of JOINS in SQL**

***JOIN is an SQL clause used to query and access data from multiple tables based on logical relationships between those tables.***

![sqljoin.png](https://www.devart.com/dbforge/sql/sqlcomplete/images/joins-types.png)

*   **INNER JOIN** - *Returns rows when there is a match in both tables.*
*   **LEFT OUTER JOIN** - *Returns all rows from the left table, even if there are no matches in the right table.*
*   **RIGHT OUTER JOIN** - *Returns all rows from the right table, even if there are no matches in the left table.*
*   **FULL OUTER JOIN** - *Returns rows when there is a match in one of the tables.*
*   **CROSS JOIN** - *Returns the Cartesian product of the sets of records from the two or more joined tables.*
*   **SELF JOIN** - *It is used to join a table to itself as if the table were two tables, temporarily renaming at least one table in the SQL statement.*

# **INNER JOIN**

INNER JOIN statement returns only the matching records or rows in both tables and is used to retrieve data that appears in both tables.

The INNER JOIN keyword selects all records from both tables as long as the condition is satisfied. This keyword will create the result-set by combining all rows from both the tables where the condition satisfies, i.e., the value of the common field will be the same.

![inner-join.png](https://static.javatpoint.com/sqlpages/images/types-of-sql-join.png)

## **Example**

`Table 1: Students`

| Student_ID | Student_Name      | Subject              | Teacher_ID |
|------------|:------------------|:---------------------|:-----------|
| 101        |  Aritra           |  Data Science        |  T201      |
| 102        |  Ashoke           |  Computer Science    |  T202      |
| 103        |  Trina            |  IT                  |  T201      |
| 104        |  Dimpu            |  AI & ML             |  T203      |
| 105        |  Anjali           |  Electronics         |  T204      |
| 106        |  Anil             |  Electrical          |  T205      |
| 107        |  Nandita          |  Mechanical          |  T206      |

`Table 2: Teachers`

| Teacher_ID  | Teacher_Name      | Teacher_Email        |
|-------------|:------------------|:---------------------|
| T201        |  Mr. Davis        |  davis@essex.ac.uk   |
| T202        |  Mrs. Jonas       |  jonas@essex.ac.uk   |
| T204        |  Mrs. Lopez       |  lopez@essex.ac.uk   |
| T207        |  Mrs. Wiley       |  wiley@essex.ac.uk   |
| T209        |  Mr. Bean         |  bean@essex.ac.uk    |
| T208        |  Mr. Lausen       |  lausen@essex.ac.uk  |
| T203        |  Dr. Ganguly      |  ganguly@essex.ac.uk |

We have two tables, i.e., **Students** and **Teachers**. Let's write the SQL Queries to join the table using the **INNER JOIN** as follows:

> `Select Student_ID, StudentName, TeacherName, TeacherEmail FROM Students s INNER JOIN Teachers t ON s.TeacherID = t.TeacherID`

| Student_ID | Student_Name | Teacher_Name   | Teacher_Email            |
|------------|:-------------|:---------------|:-------------------------|
| 101        |  Aritra      |  Mr. Davis     |  davis@essex.ac.uk                        |
| 102        |  Ashoke      |  Mrs. Jonas    |  jonas@essex.ac.uk                    |
| 103        |  Trina       |  Mr. Davis     |  davis@essex.ac.uk                        |
| 104        |  Dimpu       |  Dr. Ganguly   |  ganguly@essex.ac.uk                    |
| 105        |  Anjali      |  Mrs. Lopez    |  lopez@essex.ac.uk                    |

In [ ]:
""" The INNER JOIN keyword selects records that have matching values in both tables. """

# INNER JOIN Syntax.

SELECT column_name(s)
FROM table1
INNER JOIN table2
ON table1.column_name = table2.column_name;

"""
---------------------
JOIN Three Tables (Orders, Customers, Shippers)
---------------------

The following SQL statement selects all orders with customer and shipper information:
"""

SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
FROM ((Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID) INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);

# **OUTER JOIN**

> Left Outer Join

> Right Outer Join

> Full Outer Join

# **LEFT OUTER JOIN**

The **LEFT JOIN** keyword returns all records from the left table (table1), and the matching records from the right table (table2). If both the tables do not contain any matched records, it returns the NULL value.

![left-join.png](https://static.javatpoint.com/sqlpages/images/types-of-sql-join4.png)


## **Example**

`Table 1: Students`

| Student_ID | Student_Name      | Subject              | Teacher_ID |
|------------|:------------------|:---------------------|:-----------|
| 101        |  Aritra           |  Data Science        |  T201      |
| 102        |  Ashoke           |  Computer Science    |  T202      |
| 103        |  Trina            |  IT                  |  T201      |
| 104        |  Dimpu            |  AI & ML             |  T203      |
| 105        |  Anjali           |  Electronics         |  T204      |
| 106        |  Anil             |  Electrical          |  T205      |
| 107        |  Nandita          |  Mechanical          |  T206      |

`Table 2: Teachers`

| Teacher_ID  | Teacher_Name      | Teacher_Email        |
|-------------|:------------------|:---------------------|
| T201        |  Mr. Davis        |  davis@essex.ac.uk   |
| T202        |  Mrs. Jonas       |  jonas@essex.ac.uk   |
| T204        |  Mrs. Lopez       |  lopez@essex.ac.uk   |
| T207        |  Mrs. Wiley       |  wiley@essex.ac.uk   |
| T209        |  Mr. Bean         |  bean@essex.ac.uk    |
| T208        |  Mr. Lausen       |  lausen@essex.ac.uk  |
| T203        |  Dr. Ganguly      |  ganguly@essex.ac.uk |

We have two tables, i.e., **Students** and **Teachers**. Let's write the SQL Queries to join the table using the **LEFT JOIN** as follows:

> `Select Student_ID, StudentName, TeacherName, TeacherEmail FROM Students s LEFT JOIN Teachers t ON s.TeacherID = t.TeacherID`

| Student_ID | Student_Name | Teacher_Name   | Teacher_Email            |
|------------|:-------------|:---------------|:-------------------------|
| 101        |  Aritra      |  Mr. Davis     |  davis@essex.ac.uk                        |
| 102        |  Ashoke      |  Mrs. Jonas    |  jonas@essex.ac.uk                    |
| 103        |  Trina       |  Mr. Davis     |  davis@essex.ac.uk                        |
| 104        |  Dimpu       |  Dr. Ganguly   |  ganguly@essex.ac.uk                    |
| 105        |  Anjali      |  Mrs. Lopez    |  lopez@essex.ac.uk                    |
| 106        |  Anil      |  NULL    |  NULL    |
| 107        |  Nandita   |  NULL    |  NULL    |

In [ ]:
""" The LEFT OUTER JOIN retrieves the output of the matching row between both the tables.
    If no records match from the left table, it shows those records with NULL values. """

# LEFT JOIN Syntax.

SELECT column_name(s)
FROM table1
LEFT JOIN table2
ON table1.column_name = table2.column_name;

# **RIGHT OUTER JOIN**

The **RIGHT JOIN** keyword returns all records from the right table (table2), and the matching records from the left table (table1). If both the tables do not contain any matched records, it returns the NULL value.

![right-join.png](https://static.javatpoint.com/sqlpages/images/types-of-sql-join6.png)

## **Example**

`Table 1: Students`

| Student_ID | Student_Name      | Subject              | Teacher_ID |
|------------|:------------------|:---------------------|:-----------|
| 101        |  Aritra           |  Data Science        |  T201      |
| 102        |  Ashoke           |  Computer Science    |  T202      |
| 103        |  Trina            |  IT                  |  T201      |
| 104        |  Dimpu            |  AI & ML             |  T203      |
| 105        |  Anjali           |  Electronics         |  T204      |
| 106        |  Anil             |  Electrical          |  T205      |
| 107        |  Nandita          |  Mechanical          |  T206      |

`Table 2: Teachers`

| Teacher_ID  | Teacher_Name      | Teacher_Email        |
|-------------|:------------------|:---------------------|
| T201        |  Mr. Davis        |  davis@essex.ac.uk   |
| T202        |  Mrs. Jonas       |  jonas@essex.ac.uk   |
| T204        |  Mrs. Lopez       |  lopez@essex.ac.uk   |
| T207        |  Mrs. Wiley       |  wiley@essex.ac.uk   |
| T209        |  Mr. Bean         |  bean@essex.ac.uk    |
| T208        |  Mr. Lausen       |  lausen@essex.ac.uk  |
| T203        |  Dr. Ganguly      |  ganguly@essex.ac.uk |

We have two tables, i.e., **Students** and **Teachers**. Let's write the SQL Queries to join the table using the **RIGHT JOIN** as follows:

> `Select Student_ID, StudentName, TeacherName, TeacherEmail FROM Students s RIGHT JOIN Teachers t ON s.TeacherID = t.TeacherID`

| Student_ID | Student_Name | Teacher_Name   | Teacher_Email            |
|------------|:-------------|:---------------|:-------------------------|
| 101        |  Aritra      |  Mr. Davis     |  davis@essex.ac.uk                        |
| 102        |  Ashoke      |  Mrs. Jonas    |  jonas@essex.ac.uk                    |
| 103        |  Trina       |  Mr. Davis     |  davis@essex.ac.uk                        |
| 104        |  Dimpu       |  Dr. Ganguly   |  ganguly@essex.ac.uk                    |
| 105        |  Anjali      |  Mrs. Lopez    |  lopez@essex.ac.uk                    |
| NULL        |  NULL      |  Mrs. Wiley    |  wiley@essex.ac.uk    |
| NULL        |  NULL   |  Mr. Bean    |  bean@essex.ac.uk    |
| NULL        |  NULL   |  Mr. Lausen   |  lausen@essex.ac.uk    |

In [ ]:
""" The RIGHT OUTER JOIN retrieves the output of the matching row between both the tables.
    If no records match from the right table, it shows those records with NULL values. """

# RIGHT JOIN Syntax.

SELECT column_name(s)
FROM table1
RIGHT JOIN table2
ON table1.column_name = table2.column_name;

# **FULL OUTER JOIN**

The FULL OUTER JOIN keyword returns all records when there is a match in the left (table1) or right (table2) table records. It is a combination result set of both LEFT JOIN and RIGHT JOIN. The joined tables return all records from both the tables and if no matches are found in the table, it places NULL values.

![full-join.png](https://static.javatpoint.com/sqlpages/images/types-of-sql-join8.png)


## **Example**

`Table 1: Students`

| Student_ID | Student_Name      | Subject              | Teacher_ID |
|------------|:------------------|:---------------------|:-----------|
| 101        |  Aritra           |  Data Science        |  T201      |
| 102        |  Ashoke           |  Computer Science    |  T202      |
| 103        |  Trina            |  IT                  |  T201      |
| 104        |  Dimpu            |  AI & ML             |  T203      |
| 105        |  Anjali           |  Electronics         |  T204      |
| 106        |  Anil             |  Electrical          |  T205      |
| 107        |  Nandita          |  Mechanical          |  T206      |

`Table 2: Teachers`

| Teacher_ID  | Teacher_Name      | Teacher_Email        |
|-------------|:------------------|:---------------------|
| T201        |  Mr. Davis        |  davis@essex.ac.uk   |
| T202        |  Mrs. Jonas       |  jonas@essex.ac.uk   |
| T204        |  Mrs. Lopez       |  lopez@essex.ac.uk   |
| T207        |  Mrs. Wiley       |  wiley@essex.ac.uk   |
| T209        |  Mr. Bean         |  bean@essex.ac.uk    |
| T208        |  Mr. Lausen       |  lausen@essex.ac.uk  |
| T203        |  Dr. Ganguly      |  ganguly@essex.ac.uk |

We have two tables, i.e., **Students** and **Teachers**. Let's write the SQL Queries to join the table using the **FULL JOIN** as follows:

> `Select Student_ID, StudentName, TeacherName, TeacherEmail FROM Students s FULL JOIN Teachers t ON s.TeacherID = t.TeacherID`

| Student_ID | Student_Name | Teacher_Name   | Teacher_Email            |
|------------|:-------------|:---------------|:-------------------------|
| 101        |  Aritra      |  Mr. Davis     |  davis@essex.ac.uk           |
| 102        |  Ashoke      |  Mrs. Jonas    |  jonas@essex.ac.uk           |
| 103        |  Trina       |  Mr. Davis     |  davis@essex.ac.uk           |
| 104        |  Dimpu       |  Dr. Ganguly   |  ganguly@essex.ac.uk           |
| 105        |  Anjali      |  Mrs. Lopez    |  lopez@essex.ac.uk           |
| 106        |  Anil        |  NULL   |  NULL     |
| 107        |  Nandita     |  NULL   |  NULL     |
| NULL       |  NULL        |  Mrs. Wiley   |  wiley@essex.ac.uk    |
| NULL       |  NULL        |  Mr. Bean     |  bean@essex.ac.uk     |
| NULL       |  NULL        |  Dr. Ganguly  |  lausen@essex.ac.uk   |

In [ ]:
""" The FULL OUTER JOIN keyword returns all records when there is a match in the left or the right table records. """

# FULL JOIN Syntax.

SELECT column_name(s)
FROM table1
FULL JOIN table2
ON table1.column_name = table2.column_name;

# **CROSS JOIN**

The CROSS JOIN command in SQL, also known as a cartesian join, returns all combinations of rows from each table. In other words, the CARTESIAN JOIN returns the Cartesian product of two or more joined tables.

The CROSS JOIN produces a table that merges each row from the first table with each second table row. It is not required to include any condition in CROSS JOIN.

![cross-join.png](https://static.javatpoint.com/mysql/images/mysql-cross-join.png)

#### **Syntax:**

> `Select * from table_1 cross join table_2;`

**OR**

> `Select column1, column2, column3 FROM table_1, table_2;`

#### **Example:**

![cross-join-example.png](https://s33046.pcdn.co/wp-content/uploads/2020/02/sql-cross-join-working-principle.png)

# **REFERENCES**

> [SQL Tutorialspoint](https://www.tutorialspoint.com/sql/)

> [SQL W3Schools](https://www.w3schools.com/sql/default.asp)

> [SQL JavaTpoint](https://www.javatpoint.com/sql-tutorial)